# написать функции: 
# 1 которая суммирует все числа в списке
# 2 которая получает список чисел на вход и возвращает список чисел от 0 до 500
# 3 возвращает 2 списка в одном числа меньше или равно 500 в другом больше
#
nums = [
    640, 446, 984, 727, 650, 964, 334, 386, 248, 620,
    411, 670, 458, 314, 436, 740, 471, 516, 603, 487,
    609, 209, 710, 827, 898, 939, 644, 476, 536, 68,
    170, 569, 327, 929, 28, 761, 467, 948, 465, 204,
    994, 526, 608, 430, 275, 872, 80, 374, 740, 344,
    399, 336, 314, 389, 128, 800, 863, 111, 958, 9,
    222, 287, 708, 895, 179, 205, 828, 502, 957, 822,
    397, 612, 30, 86, 798, 596, 368, 455, 602, 332,
    327, 571, 987, 232, 635, 842, 475, 306, 134, 803
    ]

def summ_nums(m):
    result = 0
    for i in m:
        result = result + i
    return result

print(summ_nums(nums)) 

def filter_list(m):
    result = []
    for i in m:
        if i <= 500 and i >= 0:
            result.append(i)
    return result

print(filter_list(nums)) 

def filter_list_2(m):
    result = []
    result2 = [] 
    for i in m:
        if i <= 500:
            result.append(i)

        elif i > 500:
            result2.append(i)
    return result, result2

print(filter_list_2(nums)) 
