#1.  *  * Списки (Lists) *  * :
 #  - Создайте список из чисел от 1 до 10.
  # - Добавьте элемент в начало списка.
   #- Удалите первый элемент из списка.
   #- Выведите третий элемент списка.

#2.  *  * Словари (Dictionaries) *  * :
#  - Создайте словарь, где ключи - это числа от 1 до 10, а значения - их квадраты.
#   - Добавьте новое значение к существующему ключу.
#   - Удалите пару ключ-значение из словаря.
#   - Выведите значение, соответствующее ключу 5.

#3.  *  * Туризмы (Tuples) *  * :
#   - Создайте кортеж из трех элементов.
#   - Измените второй элемент кортежа.
#   - Добавьте новый элемент в конец кортежа.
#   - Выведите второй элемент кортежа.

#4.  *  * Установки (Sets) *  * :
#   - Создайте множество из чисел от 1 до 10.
#   - Объедините два множества.
#   - Выведите размер множества.
#   - Проверьте, содержится ли число 5 в множестве.

#5.  *  * Функции (Functions) *  * :
#   - Определите функцию, которая принимает список и возвращает его длину.
#   - Определите функцию, которая принимает два аргумента и возвращает их сумму.
#   - Вызовите обе функции с примерами входных данных.