# дан файл с книгами, загрузить данные из файла в библиотеку из нашей задачи
#  (структуру библиотеки нужно адаптировать под данные из файла) для загрузки
#  данных использовать модуль стандартной библиотеки csv (сначала стоит
#  ознакомиться с его возможностями) и адаптировать функции для добавления и 
# поиска книг под новый формат библиотеки также реализовать функцию удаления книг
#если будет интересно, то можно реализовать также функцию сохранения текущего состояния 
# библиотеки обратно в csv файл