# 1. Преобразование словаря в список пар *  * :
#  Напишите функцию, которая принимает словарь и возвращает список пар ключ-значение.
# 2. Преобразование словаря в список значений *  * :
#  Напишите функцию, которая принимает словарь и возвращает список его значений.
# 3. Преобразование словаря в список ключей *  * :
#  Напишите функцию, которая принимает словарь и возвращает список его ключей.
# 4. Преобразование словаря в строку *  * :
#  Напишите функцию, которая принимает словарь и возвращает его представление в виде строки.
# 5. Преобразование словаря в JSON *  * :
#  Напишите функцию, которая принимает словарь и возвращает его представление в формате JSON.
# 6. Преобразование словаря в дерево *  * :
#  Напишите функцию, которая принимает словарь и возвращает его представление в виде
#  бинарного дерева поиска.
# 7. Преобразование словаря в множество *  * :
#  Напишите функцию, которая принимает словарь и возвращает множество его ключей.
# 8. Преобразование словаря в обратный словарь *  * 
# : Напишите функцию, которая принимает словарь и возвращает обратный словарь, 
# где ключи и значения меняются местами.